# Insert Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormArray..::..Insert Method
FormArray Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Insert(
	Form item,
	int index
)
```

Visual Basic
---
```text
Public Overridable Sub Insert ( _
	item As Form, _
	index As Integer _
)
```

Visual C++
---
```text
public:
virtual void Insert(
	Form^ item,
	int index
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..Form
index
    Type: System..::..Int32
# See Also
FormArray Class
Autodesk.Revit.DB Namespace